export default {
	no_data: "ไม่พบข้อมูล",
	undefined: "ไม่ได้ระบุ",
	title: {
		success: {
			edit: "แก้ไขสำเร็จ!",
			create: "สร้างใหม่สำเร็จ!",
			approve: "อนุมัติการโอนสำเร็จ",
			reject: "ปฏิเสธการโอนสำเร็จ",
			delete: "ลบข้อมูลสำเร็จ!",
			save: "บันทึกสำเร็จ!",
			default: "ทำรายการสำเร็จ",
		},
		error: {
			edit: "แก้ไขไม่สำเร็จ!",
			create: "สร้างใหม่ไม่สำเร็จ!",
			delete: "ลบข้อมูลไม่สำเร็จ!",
			approve: "อนุมัติการโอนไม่สำเร็จ",
			reject: "ปฏิเสธการโอนไม่สำเร็จ",
			save: "บันทึกไม่สำเร็จ!",
			default: "ทำรายการไม่สำเร็จ",
		},
		warning: "กรุณายืนยัน",
		warning_delete: "ลบข้อมูล?",
	},
	text: {
		success: {
			edit: "ข้อมูลของคุณได้รับการแก้ไขแล้ว",
			create: "สร้างข้อมูลใหม่สำเร็จ",
			delete: "ข้อมูลของคุณถูกลบแล้ว",
			approve: "การโอนเครดิตได้รับการอนุมัติแล้ว",
			reject: "ปฏิเสธการโอนเครดิตแล้ว",
			defualt: "ทำรายการสำเร็จ",
		},
		error: {
			edit: "ข้อมูลของคุณยังไม่ได้รับการแก้ไข",
			create: "การสร้างไม่สำเร็จ กรุณาตรวจสอบข้อมูลใหม่อีกครั้ง",
			default: "ทำรายการไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",

			// delete: 'Failed to create, please check your given information.',
		},
		warning: {
			edit: "กรุณายืนยันการแก้ไขข้อมูล",
			create: "กรุณายืนยันการสร้างข้อมูล",
			delete: "ข้อมูลที่คุณเลือกจะถูกนำออกจากระบบถาวร",
			default: "กรุณายืนยันการทำรายการ",
		},
	},
};
