export default {
    require: {
        firstname: "กรุณาระบุชื่อ",
        lastname: "กรุณาระบุนามสกุล",
        organization: "กรุณาระบุองค์กร/หน่วยงาน",
        role: "กรุณาระบุบทบาท",
        email: "กรุณาระบุอีเมล",
        password: "กรุณาระบุรหัสผ่าน",
        confirm_password: "กรุณายืนยันรหัสผ่าน",
        accountTypes: "กรุณาระบุประเภทบัญชี",
        transactionTypes: "กรุณาระบุประเภทธุรกรรม",
        Accountname: "กรุณาระบุชื่อบัญชี",
        account_type: "กรุณาระบุประเภทบัญชี",
    },
    min_length: {
        firstname: "ชื่อต้องมีความยาวอย่างน้อย 2 ตัวอักษร",
        lastname: "นามสกุลต้องมีความยาวอย่างน้อย 2 ตัวอักษร",
        password: "รหัสผ่านต้องมีความยาวอย่างน้อย 8 ตัวอักษร",
        Accountname: "ชื่อบัญชีต้องมีความยาวอย่างน้อย 2 ตัวอักษร",
    },
    same_as: {
        confirm_password: `รหัสผ่านไม่ตรงกัน`,
    },
    pattern: {
        email: "กรุณาระบุอีเมลให้ถูกต้อง",
        firstname_contain_special: "ชื่อต้องไม่มีอักขระพิเศษ",
        lastname_contain_special: "นามสกุลต้องไม่มีอักขระพิเศษ",
        Accountname: "ชื่อบัญชีต้องไม่มีอักขระพิเศษ",
    },
    strong_password: "รหัสผ่านต้องประกอบไปด้วยตัวอักษรตัวพิมพ์ใหญ่และพิมพ์เล็ก ตัวเลขรวมทั้งสัญลักษณ์ต่างๆ ประกอบกันด้วยจำนวนมากกว่าหรือเท่ากับ 8 ตัวอักษร",
    min_max: 'จำนวนคาร์บอนต้องมากกว่า {min} และต้องน้อยกว่าหรือเท่ากับ {max}'
};