export default {
    openAccount: 'เปิดบัญชีใหม่ (Open Account)',
    serviceAgreement: 'ข้อตกลงเกี่ยวกับการให้บริการสมัครเปิดบัญชีคาร์บอนเครดิต',
    accept: 'ยอมรับ',
    refuse: 'ปฏิเสธ',
    accountName: 'ชื่อเรียกบัญชี',
    email: 'อีเมล',
    firstname: 'ชื่อ',
    lastname: 'นามสกุล',
    organization: 'ชื่อองค์กร/หน่วยงาน',
    password: 'รหัสผ่าน',
    passwordConfirmation: 'ยืนยันรหัสผ่าน',
    document: 'อัพโหลดเอกสาร',
    chooseAfile: 'เลือกไฟล์ หรือ ลากไฟล์ลงที่นี่',
    onlyPDF: '(รองรับเฉพาะไฟล์ PDF เท่านั้น)',
    instructions: 'คำแนะนำการเปิดบัญชีใหม่',
    confirm: 'ยืนยันข้อมูลถูกต้อง',
    accountOpening: 'การเปิดบัญชีจะใช้เวลาดำเนินการประมาณ 1-3 วันทำการ หากบัญชีของคุณได้รับการอนุมัติแล้ว ระบบจะทำการแจ้งเตือนการเปิดบัญชีไปยังอีเมลที่ระบุ',
    cancel: 'ยกเลิก',
    submit: 'ส่งข้อมูลการสมัคร',
    accountType: 'ประเภทบัญชี',

    showDocument: {
        title: 'ไฟล์เอกสาร',
        card_id: 'สำเนาบัตรประชาชน/หนังสือเดินทาง',
        verified: 'หนังสือรับรองนิติบุคล ที่กรมพัฒนาธุรกิจการค้า กระทรวงพาณิชย์ออกให้ โดยนายทะเบียนรับรองไม่เกิน 3 เดือน',
        verified1: 'สำเนาพระราชบัญญัติกฎหมาย หรือหลักฐานที่เกี่ยวข้องแสดงการจัดตั้งหน่วยงาน',
        authorize: 'หนังสือมอบอำนาจให้ผู้รับมอบอำนาจ (ผู้ใช้งานระบบ)',
        card_id_owner: 'สำเนาบัตรประชาชน หรือหนังสือเดินทาง ของผู้มอบอำนาจ',
        card_id_representative: 'สำเนาบัตรประชาชน หรือหนังสือเดินทาง ของผู้รับมอบอำนาจ',
        employment_certificate: 'หนังสือรับรองการทำงาน ออกให้โดยบริษัท'
    },
    stepbar: {
        step1: 'ประเภทบัญชี',
        step2: 'การยินยอม',
        step3: 'แบบฟอร์ม',
        step4: 'อัพโหลดไฟล์',
        step5: 'ข้อมูลโดยรวม',
    },
    validate: {
        document: 'โปรดแนบไฟล์เอกสาร',
        accountName: 'โปรดระบุชื่อเรียกบัญชี',
        containsNotSpecial: 'ห้ามใช้อักษรพิเศษ',
        minLength2: 'โปรดระบุ 2 ตัวอักษรขึ้นไป',
        email: 'โปรดระบุอีเมล',
        emailValidate: 'อีเมลไม่ถูกต้อง',
        firstname: 'โปรดระบุชื่อจริง',
        lastname: 'โปรดระบุนามสกุล',
        organization: 'โปรดระบุชื่อองค์กร/หน่วยงาน',
        password: 'โปรดระบุรหัสผ่าน',
        minLength8: 'รหัสผ่านต้องมีอย่างน้อย 8 ตัวอักษร',
        passwordConfirmation: 'รหัสผ่านไม่ตรงกัน',

        id_card: 'โปรดระบุเลขบัตรประจำตัวประชาชน/หนังสือเดินทาง',
        phone_number: 'โปรดระบุหมายเลขโทรศัพท์',
        address: 'โปรดระบุที่อยู่ปัจจุบัน',
        province: 'โปรดระบุจังหวัด',
        district: 'โปรดระบุอำเภอ/เขต',
        subdistrict: 'โปรดระบุตำบล/แขวง',
        postcode: 'โปรดระบุรหัสไปรษณีย์',
        requestPermission: 'โปรดระบุประเภทผู้ยื่นคำขอเปิดบัญชี (อย่างน้อย 1 ประเภท)',

        juristic: {
            name: 'โปรดระบุชื่อนิติบุคคล กลุ่มบุคคล หรือคณะบุคคล',
            office_address: 'โปรดระบุที่อยู่สำนักงาน'
        },
        government: {
            name: 'โปรดระบุชื่อหน่วยงาน',
            office_address: 'โปรดระบุที่อยู่หน่วยงาน'
        },
        account_type: 'โปรดระบุประเภทบัญชีผู้ใช้',
        role: 'โปรดระบุบทบาท',


    },
    form: {
        title: "แบบฟอร์มหนังสือแจ้งความประสงค์เปิดบัญชีในระบบทะเบียนคาร์บอนเครดิต",
        guest: {
            subtitle: "ประเภทบุคคลธรรมดา",
        },
        juristic: {
            subtitle: "ประเภทนิติบุคคล กลุ่มบุคคล หรือคณะบุคคล",
            name: 'ชื่อนิติบุคคล กลุ่มบุคคล หรือคณะบุคคล',
            address: 'ที่อยู่สำนักงาน',
            number: 'เลขทะเบียนนิติบุคคล(หากมี)',
            alien_id: 'เลขที่ใบอนุญาตประกอบธุรกิจของคนต่างด้าว',
            alien_id_description: '(กรณีคนต่างด้าวที่ต้องขออนุญาตประกอบธุรกิจของคนต่างด้าว)',
            grantee_info: {
                title: 'ผู้แทนหรือผู้ได้รับมอบอำนาจในการทำธุรกรรมในระบบทะเบียนคาร์บอนเครดิต',

            },
            account_detail: {
                title: 'รายละเอียดบัญชี',

            }
        },
        government: {
            subtitle: "ประเภทองค์กรของรัฐบาล รัฐวิสาหกิจ หรือหน่วยงานของรัฐ",
            name: 'ชื่อหน่วยงาน',
            address: 'ที่อยู่หน่วยงาน',


            grantee_info: {
                title: 'ผู้แทนหรือผู้ได้รับมอบอำนาจในการทำธุรกรรมในระบบทะเบียนคาร์บอนเครดิต',

            },
            account_detail: {
                title: 'รายละเอียดบัญชี',

            }
        },

        firstname: "ชื่อจริง",
        lastname: "นามสกุล",
        card_id: "เลขบัตรประจำตัวประชาชน/หนังสือเดินทาง",
        issued_by: "ออกให้โดย (กรณีหนังสือเดินทางคนต่างด้าว)",
        phone_number: "หมายเลขโทรศัพท์",
        email: "อีเมล / ไปรษณีย์อิเล็กทรอนิกส์",
        password: "รหัสผ่าน",
        passwordConfirmation: "ยืนยันรหัสผ่าน",
        address: "ที่อยู่ปัจจุบัน",
        province: "จังหวัด",
        district: "อำเภอ/เขต",
        subdistrict: "ตำบล/แขวง",
        postcode: "รหัสไปรษณีย์",
        accountName: "ชื่อบัญชี (ใช้อักษรภาษาอังกฤษตามชื่อและสกุลของผู้ยื่นคำขอ)",
        request_permission: {
            title: "ประเภทผู้ยื่นคำขอเปิดบัญชี (เลือกได้มากกว่า ๑ ประเภท)",
            item1: "ผู้พัฒนาโครงการหรือผู้เป็นเจ้าของโครงการลดก๊าซเรือนกระจก",
            item2: "ผู้มีความประสงค์ซื้อหรือรับโอนคาร์บอนเครดิต",
            item3: "ผู้ได้รับคาร์บอนเครดิตผ่านศูนย์ซื้อขายคาร์บอนเครดิต",
        },
        document: {
            card_id: 'อัพโหลด สำเนาบัตรประชาชน',
            verified: 'หนังสือรับรองนิติบุคล ที่กรมพัฒนาธุรกิจการค้า กระทรวงพาณิชย์ออกให้ โดยนายทะเบียนรับรองไม่เกิน 3 เดือน',
            verified1: 'สำเนาพระราชบัญญัติกฎหมาย หรือหลักฐานที่เกี่ยวข้องแสดงการจัดตั้งหน่วยงาน',

            authorize: "หนังสือมอบอำนาจให้ผู้รับมอบอำนาจ (ผู้ใช้งานระบบ)",
            card_id_owner: "สำเนาบัตรประชาชน หรือหนังสือเดินทาง ของผู้มอบอำนาจ",
            card_id_representative: "สำเนาบัตรประชาชน หรือหนังสือเดินทาง ของผู้รับมอบอำนาจ",
            employment_certificate: "หนังสือรับรองการทำงาน ออกให้โดยบริษัท",
        },
    },
    agreement: {
        title: 'ข้อตกลงเกี่ยวกับการให้บริการสมัครเปิดบัญชีคาร์บอนเครดิต',
        sentense: 'แบบฟอร์มหนังสือให้ความยินยอมสำหรับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล ขององค์การบริหารจัดการก๊าซเรือนกระจก (องค์การมหาชน)',
        sentense1: `อบก. จะเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลของข้าพเจ้า ที่ข้าพเจ้าได้ให้ไว้โดยตรงในขณะที่ยื่นคำขอเปิดบัญชีในระบบทะเบียนคาร์บอนเครดิตหรือที่เกิดขึ้นในระหว่างขั้นตอนการพิจารณาของ อบก. ขั้นตอนใด ๆ ได้แก่ ชื่อ-นามสกุล หมายเลขบัตรประจำตัวประชาชนหรือหมายเลขหนังสือเดินทาง รูปถ่าย ที่อยู่ อีเมล ลายมือชื่อ สัญชาติ เพศ ตลอดจนข้อมูลอื่นใดตามที่ปรากฏในเอกสารหลักฐานที่ยื่นให้กับ อบก. หรือเอกสารหลักฐานที่ อบก. ได้รับโดยอ้อม ข้าพเจ้าขอให้ความยินยอมในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของข้าพเจ้า ดังนี้`,
        p1: `๑. ให้ อบก. และผู้ปฏิบัติงานของ อบก. นำข้อมูลส่วนบุคคลของข้าพเจ้าที่เก็บรวบรวมไปใช้ในการติดต่อสื่อสารประชาสัมพันธ์เกี่ยวกับกิจกรรมการส่งเสริมพัฒนาศักยภาพ หรือดำเนินการอื่นใดที่เกี่ยวข้องกับภารกิจของ อบก.`,
        p2: `๒. ให้ อบก. สามารถเปิดเผยข้อมูลของข้าพเจ้า ได้แก่ ชื่อ-นามสกุล ตำแหน่ง ข้อมูลติดต่อต่อสาธารณะ ได้แก่ เว็บไซต์ของ อบก. หรือช่องทางอื่นใดขององค์การ`,
        p3: `๓. ให้ อบก. สามารถเปิดเผยข้อมูลของข้าพเจ้ากับผู้ประมวลผลข้อมูลส่วนบุคคลตามที่ได้รับมอบหมายจาก อบก. ในการดำเนินการเกี่ยวกับการศึกษา วิจัย การพัฒนาและปรับปรุงระบบงาน หรือการดำเนินการอื่นใดที่เกี่ยวข้องกับภารกิจของ อบก. ตามขอบเขตของข้อตกลงประมวลผลข้อมูลส่วนบุคคล`,
        p4_1: "ข้าพเจ้าอาจเพิกถอนความยินยอมทั้งหมดหรือส่วนใดส่วนหนึ่งตามหนังสือฉบับนี้เมื่อใดก็ได้ โดยข้าพเจ้าจะแจ้งให้ อบก. ทราบเป็นหนังสือตามแบบที่ อบก. กำหนด และให้ อบก. สอบถามถึงเหตุผลแห่งการเพิกถอนนั้นได้",
        p4_2: "การเพิกถอนความยินยอมของข้าพเจ้าไม่มีผลกระทบต่อการดำเนินการใด ๆ ที่ อบก. ได้ดำเนินการไปแล้ว",
        p4_3: "ในกรณีที่การเพิกถอนความยินยอมตามหนังสือฉบับนี้ เกิดผลกระทบต่อสิทธิหรือหน้าที่ใด ๆ ของข้าพเจ้า ข้าพเจ้ายอมรับผลกระทบที่เกิดขึ้นจากการนั้นได้",
        p4_4: "ข้าพเจ้าได้อ่านและเข้าใจข้อความดังกล่าวโดยตลอดแล้ว จึงได้ลงลายมือชื่อไว้เป็นสำคัญ"

    },
    account_type: {
        title: 'เลือกประเภทบัญชี',
        subtitle: 'กรุณาเลือกประเภทบัญชีที่ต้องการเปิด',
        option: {
            guest: 'บุคคลทั่วไป',
            juristic: 'นิติบุคคล',
            government: 'หน่วยงานราชการองค์กรของรัฐบาลรัฐวิสาหกิจ หรือหน่วยงานของรัฐ',

        },
        document_discription: {
            title: 'เอกสารประกอบการเปิดบัญชี',
            guest: {
                title: 'กรณีที่เป็นบุคคลทั่วไป',
                // item1:'แบบฟอร์มแจ้งความประสงค์จะเปิดบัญชีซื้อขายคาร์บอนเครดิต โดยระบุอีเมลที่ต้องการใช้งานในระบบ',
                item1: 'สำเนาบัตรประชาชน',
            },
            juristic: {
                title: 'กรณีที่เป็นนิติบุคคล กลุ่มบุคคล หรือคณะบุคคล',
                item1: 'ชื่อ ที่อยู่ และหนังสือรับรองนิติบุคล ที่กรมพัฒนาธุรกิจการค้า กระทรวงพาณิชย์ออกให้ โดยนายทะเบียนรับรองไม่เกิน 3 เดือน',

                item2: 'หนังสือมอบอำนาจให้ผู้รับมอบอำนาจ (ผู้ใช้งานระบบ)',
                // item4:'สำเนาบัตรประชาชน หรือหนังสือเดินทาง ของผู้มอบอำนาจ',
                item3: 'สำเนาบัตรประชาชน หรือหนังสือเดินทาง ของผู้รับมอบอำนาจ',
                // item6:'หนังสือรับรองการทำงาน ออกให้โดยบริษัท',
            },
            government: {
                title: 'กรณีที่เป็นหน่วยงานของรัฐ ราชการ รัฐวิสาหกิจ',
                // item1:'แบบฟอร์มแจ้งความประสงค์จะเปิดบัญชีซื้อขายคาร์บอนเครดิต โดยระบุอีเมลที่ต้องการใช้งานในระบบ',
                item1: 'ชื่อ ที่อยู่ และสำเนาพระราชบัญญัติกฎหมาย หรือหลักฐานที่เกี่ยวข้องแสดงการจัดตั้งหน่วยงาน',
                item2: 'หนังสือมอบอำนาจให้ผู้รับมอบอำนาจ (ผู้ใช้งานระบบ)',
                // item4:'สำเนาบัตรประชาชน หรือหนังสือเดินทาง ของผู้มอบอำนาจ',
                item3: 'สำเนาบัตรประชาชน หรือหนังสือเดินทาง ของผู้รับมอบอำนาจ',
            },
        }
    }

};