export default {
	confirm_correction: "ยืนยันการแก้ไข",
	Please_confirm_the_correction: "กรุณายืนยันการแก้ไขข้อมูล",
	confirm: "ยืนยัน",
	approve: "อนุมัติ",
	reject: "ปฏิเสธ",
	cancel: "ยกเลิก",
	Correction_succeeded: "ทำการแก้ไขสำเร็จ",

	confirm_creation: "ยืนยันการเพิ่มข้อมูล",
	Please_confirm_the_creation: "กรุณายืนยันการเพิ่มโครงการ",
	creation_success: "ทำการเพิ่มโครงการสำเร็จ",
	complete_information: "กรุณากรอกข้อมูลให้ครบถ้วน",
	complete_information_text: "กรุณาตรวจสอบข้อมูล และดำเนินการใหม่อีกครั้ง",

	invalid: "เกิดข้อผิดพลาด",
	error: "ไม่สำเร็จ",
	successful: "สำเร็จ",
	fail: "ล้มเหลว",

	confirm_certificate: {
		title: "ยืนยันการรับรอง",
		text: "ข้อมูลครบถ้วน และยืนยันการรับรองคาร์บอนเครดิต",
	},
	no_data: "ไม่พบข้อมูล",
	undefined: "ไม่ได้ระบุ",
	waiting:'กรุณารอสักครู่',

	transferModal:{
		title:{
			success:'กำลังดำเนินการโอน',
			error:'ดำเนินการโอนไม่สำเร็จ',
			invalid:'ข้อมูลไม่ครบถ้วน',
			confirm:'ยืนยันการโอน'
		},
		text:{
			success:'รอการอนุมัติจากนายทะเบียน',
			error:'จำนวนครดิตของคุณไม่เพียงพอ ',
			invalid:'กรุณากรอกข้อมูลให้ครบถ้วน',
			confirm:'กรุณายืนยันการทำรายการ'
		}
	},
	transaction:{
		approval:{
			title:{
				confirm_approve:'ยืนยันการอนุมัติ',
				success_approve:'อนุมัติสำเร็จ',
				error_approve:'อนุมัติไม่สำเร็จ',

				confirm_reject:'ยืนยันการปฏิเสธ',
				success_reject:'ปฏิเสธการโอนสำเร็จ',
				error_reject:'ปฏิเสธการโอนไม่สำเร็จ'
			},
			text:{
				

				confirm_approve:'กรุณาตรวจสอบข้อมูลก่อนทำการอนุมัติการโอน และจะไม่สามารถเรียกคืนข้อมูลได้หลังจากทำการอนุมัติแล้ว',
				success_approve:'อนุมัติการโอนสำเร็จ',
				error_approve:'การอนุมัติการโอนไม่สำเร็จ กรุณาลองใหม่อีกครั้ง',

				confirm_reject:'กรุณาตรวจสอบข้อมูลก่อนทำการอนุมัติการโอน และจะไม่สามารถเรียกคืนข้อมูลได้หลังจากทำการอนุมัติแล้ว',
				// success_reject:'ปฏิเสธการโอนสำเร็จ',
				error_reject:'กรุณาลองใหม่อีกครั้ง'
			},
			input:{
				label1:'รายละเอียดการอนุมัติ (ถ้ามี)',
				label2:'รายละเอียดการปฏิเสธ (โปรดระบุ)',
				placeholder:'ข้อความ...',
				error_msg:'กรุณาระบุเหตุผลการปฏิเสธการโอน'
			}
			
		},
		setting: {
			confirm: {
				title: "ยืนยันการตั้งค่า",
				sub_title: "การดำเนินการนี้จะมีผลหลังจากที่คุณยืนยัน เพื่อ{action}ใช้งานการอนุมัติธุรกรรมทั้งหมดโดยอัตโนมัติ",
			},
			success: {
				enabled: {
					title: "เปิดใช้งานสำเร็จ",
					sub_title: "เปิดใช้งานการอนุมัติอัตโนมัติแล้ว",
				},
				disabled: {
					title: "ปิดใช้งานสำเร็จ",
					sub_title: "การอนุมัติอัตโนมัติถูกปิดใช้งาน",
				},
			},
			error: {
				title: "การตั้งค่าไม่สำเร็จ",
				sub_title: "กรุณาลองใหม่อีกครั้ง",
			},
		},
	},
	account:{
		input:{
			label1:'รายละเอียดการอนุมัติ (ถ้ามี)',
			label2:'รายละเอียดการปฏิเสธ (โปรดระบุ)',
			placeholder:'ข้อความ...',
			error_msg:'กรุณาระบุเหตุผลการปฏิเสธ'
		}
	},
	api:{
		create:{
			title:'ยืนยันการเพิ่มข้อมูล',
			sub_title:'กรุณายืนยันการเพิ่มข้อมูล API'
		},
		edit:{
			title:'ยืนยันการเพิ่มข้อมูล',
			sub_title:'กรุณายืนยันการเพิ่มข้อมูล API'
		},
		delete:{
			title:'ยืนยันการเพิ่มข้อมูล',
			sub_title:'กรุณายืนยันการเพิ่มข้อมูล API'
		},
		reset:{
			title:'ยืนยันการรีเซ็ต Secrey key',
			sub_title:'กรุณายืนยันการรีเซ็ต Secrey key',
			success:'ทำการรีเซ็ต Secrey key สำเร็จ',
			error:'ทำการรีเซ็ต Secrey key ไม่สำเร็จ'
		},
		success:{
			title:'เพิ่มข้อมูลสำเร็จ',
			sub_title:'โปรดคัดลอก Access key และ Secret key เพื่อใช้ในการ Authentication'
		},
		error:{
			title:'เพิ่มข้อมูลไม่สำเร็จ',
			sub_title:'เกิดข้อผิดพลาดระหว่างการเพิ่ม กรุณาทำรายการใหม่อีกครั้ง'
		},

	},
	profile:{
		change_password:{
			confirm:{
				title:'ยืนยันการทำรายการ',
				sub_title:'กรุณายืนยันการเปลี่ยนรหัสผ่าน',
			},
			success:{
				title:'เปลี่ยนรหัสผ่านสำเร็จ',
				sub_title:'',
			},
			error:{
				title:'เปลี่ยนรหัสผ่านไม่สำเร็จ',
				sub_title:''
			}
		}
	},
	user:{
		edit:{
			confirm:{
				title:'ยืนยันการแก้ไข',
				sub_title:'คุณยืนยันที่จะแก้ไขข้อมูลผู้ใช้ดังกล่าวหรือไม่'
			},
			success: {
				title: "แก้ไขสำเร็จ",
				sub_title: "ทำการแก้ไขข้อมูลผู้ใช้สำเร็จ",
			},
			error: {
				title: "แก้ไขไม่สำเร็จ",
				sub_title: "แก้ไข้ข้อมูลไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",
			},
		},
		create: {
			confirm: {
				title: "ยืนยันการสร้าง",
				sub_title: "กรุณายืนยันการสร้างบัญชีผู้ใช้ใหม่",
			},
			success: {
				title: "สร้างสำเร็จ",
				sub_title: "สร้างบัญชีผู้ใช้สำเร็จ",
			},
			error: {
				title: "สร้างบัญชีผู้ใช้ไม่สำเร็จ",
				sub_title: "สร้างบัญชีผู้ใช้ไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",
			},
		},
	},
	auth:{
		forgotPassword:{
			success: {
				title: "สำเร็จ!",
				sub_title: "เราได้ส่งลิงค์สำหรับรีเซ็ตรหัสผ่านไปยังอีเมลของคุณแล้ว",
			},
			error: {
				title: "ไม่สำเร็จ",
				sub_title: "ร้องขอเปลี่ยนรหสผ่านไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",
			},
		},
		newPassword:{
			success: {
				title: "สำเร็จ!",
				sub_title: "รหัสผ่านของคุณถูกเปลี่ยนกรุณาเข้าสู่ระบบด้วยรหัสผ่านใหม่",
			},
			error: {
				title: "ไม่สำเร็จ!",
				sub_title: "เปลี่ยนรหัสผ่านไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",
			},
		}
	},
	project:{
		certifiedCredit:{
			confirm: {
				title: "ยืนยันการรับรอง",
				sub_title: "กรุณายืนยันการรับรองคาร์บอนเครดิต",
			},
			success: {
				title: "รับรองสำเร็จ",
				sub_title: "ระบบได้ทำการรับรองคาร์บอนเครดิตจำนวน {amount} เครดิต ของคุณแล้ว",
			},
			error: {
				title: "รับรองไม่สำเร็จ",
				sub_title: "ทำการรับรองคาร์บอนเครดิตไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",
			},
		}
	},
	openAccount:{
		confirm: {
			title: "ยืนยันการเปิดบัญชี",
			sub_title: "โปรดยืนยันข้อมูลในการเปิดบัญชีคาร์บอนเครดิต",
		},
		success: {
			title: "ดำเนินการสำเร็จ",
			sub_title: "อยู่ระหว่างรออนุมัติจากเจ้าหน้าที่ เมื่อเจ้าหน้าที่ดำเนินการแล้ว ระบบจะแจ้งเตือนไปยังอีเมลของท่าน",
		},
		error: {
			title: "ดำเนินการไม่สำเร็จ",
			sub_title: "ดำเนินการเปิดบัญชีไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",
		},
	},
	checkout:{
		confirm: {
			title: "ยืนยันการชำระเงิน",
			sub_title: "โปรดยืนยันการทำรายการ",
		},
		success: {
			title: "ชำระเงินสำเร็จ",
			sub_title: "อยู่ระหว่างรออนุมัติจากเจ้าหน้าที่ เมื่อเจ้าหน้าที่ดำเนินการแล้ว ระบบจะแจ้งเตือนไปยังอีเมลของท่าน",
		},
		error: {
			title: "ชำระเงินไม่สำเร็จ",
			sub_title: "กรุณาลองใหม่อีกครั้ง",
		},
	},
	buffer:{
		confirm: {
			title: "ยืนยันการรับรองเครดิต",
			title2: "ยืนยันการยกเลิกเครดิต",
			sub_title: "โปรดยืนยันการทำรายการ",
			sub_title2: "โปรดยืนยันการทำรายการ",
		},
		success: {
			title: "รับรองเครดิตสำเร็จ",
			title2: "ยกเลิกเครดิตสำเร็จ",
			sub_title: "อยู่ระหว่างรออนุมัติจากเจ้าหน้าที่ เมื่อเจ้าหน้าที่ดำเนินการแล้ว ระบบจะแจ้งเตือนไปยังอีเมลของท่าน",
		},
		error: {
			title: "รับรองเครดิตไม่สำเร็จ",
			title2: "ยกเลิกเครดิตไม่สำเร็จ",
			sub_title: "กรุณาลองใหม่อีกครั้ง",
		},
		input:{
			label:'บันทึกช่วยจำ',
			placeholder:'ข้อความ',
		}
	}
};
